.. _iban_userguide:

IBAN Strings
============

Introduction
------------

The function :func:`clean_es_iban() <dataprep.clean.clean_es_iban.clean_es_iban>` cleans a column containing Spanish IBAN (IBAN) strings, and standardizes them in a given format. The function :func:`validate_es_iban() <dataprep.clean.clean_es_iban.validate_es_iban>` validates either a single IBAN strings, a column of IBAN strings or a DataFrame of IBAN strings, returning `True` if the value is valid, and `False` otherwise.

IBAN strings can be converted to the following formats via the `output_format` parameter:

* `compact`: only number strings without any seperators or whitespace, like "ES7712341234161234567890"
* `standard`: IBAN strings with proper whitespace in the proper places, like "ES77 1234 1234 1612 3456 7890"
* `ccc`: return the CCC (CÃ³digo Cuenta Corriente) part of the number, like "12341234161234567890".

Invalid parsing is handled with the `errors` parameter:

* `coerce` (default): invalid parsing will be set to NaN
* `ignore`: invalid parsing will return the input
* `raise`: invalid parsing will raise an exception

The following sections demonstrate the functionality of `clean_es_iban()` and `validate_es_iban()`.

### An example dataset containing IBAN strings

In [1]:
import pandas as pd
import numpy as np
df = pd.DataFrame(
    {
        "iban": [
            "ES771234-1234-16 1234567890",
            "R1601101050000010547023795",
            "999 999 999",
            "004085616",
            "002 724 334",
            "hello",
            np.nan,
            "NULL",
        ], 
        "address": [
            "123 Pine Ave.",
            "main st",
            "1234 west main heights 57033",
            "apt 1 789 s maple rd manhattan",
            "robie house, 789 north main street",
            "1111 S Figueroa St, Los Angeles, CA 90015",
            "(staples center) 1111 S Figueroa St, Los Angeles",
            "hello",
        ]
    }
)
df

,iban,address
0,ES771234-1234-16 1234567890,123 Pine Ave.
1,R1601101050000010547023795,main st
2,999 999 999,1234 west main heights 57033
3,004085616,apt 1 789 s maple rd manhattan
4,002 724 334,"robie house, 789 north main street"
5,hello,"1111 S Figueroa St, Los Angeles, CA 90015"
6,NaN,"(staples center) 1111 S Figueroa St, Los Angeles"
7,NULL,hello

## 1. Default `clean_es_iban`

By default, `clean_es_iban` will clean iban strings and output them in the standard format with proper separators.

In [2]:
from dataprep.clean import clean_es_iban
clean_es_iban(df, column = "iban")

,iban,address,iban_clean
0,ES771234-1234-16 1234567890,123 Pine Ave.,ES77 1234 1234 1612 3456 7890
1,R1601101050000010547023795,main st,NaN
2,999 999 999,1234 west main heights 57033,NaN
3,004085616,apt 1 789 s maple rd manhattan,NaN
4,002 724 334,"robie house, 789 north main street",NaN
5,hello,"1111 S Figueroa St, Los Angeles, CA 90015",NaN
6,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
7,NULL,hello,NaN

## 2. Output formats

This section demonstrates the output parameter.

### `standard` (default)

In [3]:
clean_es_iban(df, column = "iban", output_format="standard")

,iban,address,iban_clean
0,ES771234-1234-16 1234567890,123 Pine Ave.,ES77 1234 1234 1612 3456 7890
1,R1601101050000010547023795,main st,NaN
2,999 999 999,1234 west main heights 57033,NaN
3,004085616,apt 1 789 s maple rd manhattan,NaN
4,002 724 334,"robie house, 789 north main street",NaN
5,hello,"1111 S Figueroa St, Los Angeles, CA 90015",NaN
6,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
7,NULL,hello,NaN

### `compact`

In [4]:
clean_es_iban(df, column = "iban", output_format="compact")

,iban,address,iban_clean
0,ES771234-1234-16 1234567890,123 Pine Ave.,ES7712341234161234567890
1,R1601101050000010547023795,main st,NaN
2,999 999 999,1234 west main heights 57033,NaN
3,004085616,apt 1 789 s maple rd manhattan,NaN
4,002 724 334,"robie house, 789 north main street",NaN
5,hello,"1111 S Figueroa St, Los Angeles, CA 90015",NaN
6,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
7,NULL,hello,NaN

### `ccc`

In [5]:
clean_es_iban(df, column = "iban", output_format="ccc")

,iban,address,iban_clean
0,ES771234-1234-16 1234567890,123 Pine Ave.,12341234161234567890
1,R1601101050000010547023795,main st,NaN
2,999 999 999,1234 west main heights 57033,NaN
3,004085616,apt 1 789 s maple rd manhattan,NaN
4,002 724 334,"robie house, 789 north main street",NaN
5,hello,"1111 S Figueroa St, Los Angeles, CA 90015",NaN
6,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
7,NULL,hello,NaN

## 3. `inplace` parameter

This deletes the given column from the returned DataFrame. 
A new column containing cleaned IBAN strings is added with a title in the format `"{original title}_clean"`.

In [6]:
clean_es_iban(df, column="iban", inplace=True)

,iban_clean,address
0,ES77 1234 1234 1612 3456 7890,123 Pine Ave.
1,NaN,main st
2,NaN,1234 west main heights 57033
3,NaN,apt 1 789 s maple rd manhattan
4,NaN,"robie house, 789 north main street"
5,NaN,"1111 S Figueroa St, Los Angeles, CA 90015"
6,NaN,"(staples center) 1111 S Figueroa St, Los Angeles"
7,NaN,hello

## 4. `errors` parameter

### `coerce` (default)

In [7]:
clean_es_iban(df, "iban", errors="coerce")

,iban,address,iban_clean
0,ES771234-1234-16 1234567890,123 Pine Ave.,ES77 1234 1234 1612 3456 7890
1,R1601101050000010547023795,main st,NaN
2,999 999 999,1234 west main heights 57033,NaN
3,004085616,apt 1 789 s maple rd manhattan,NaN
4,002 724 334,"robie house, 789 north main street",NaN
5,hello,"1111 S Figueroa St, Los Angeles, CA 90015",NaN
6,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
7,NULL,hello,NaN

### `ignore`

In [8]:
clean_es_iban(df, "iban", errors="ignore")

,iban,address,iban_clean
0,ES771234-1234-16 1234567890,123 Pine Ave.,ES77 1234 1234 1612 3456 7890
1,R1601101050000010547023795,main st,R1601101050000010547023795
2,999 999 999,1234 west main heights 57033,999 999 999
3,004085616,apt 1 789 s maple rd manhattan,004085616
4,002 724 334,"robie house, 789 north main street",002 724 334
5,hello,"1111 S Figueroa St, Los Angeles, CA 90015",hello
6,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
7,NULL,hello,NaN

## 4. `validate_es_iban()`

`validate_es_iban()` returns `True` when the input is a valid IBAN. Otherwise it returns `False`.

The input of `validate_es_iban()` can be a string, a Pandas DataSeries, a Dask DataSeries, a Pandas DataFrame and a dask DataFrame.

When the input is a string, a Pandas DataSeries or a Dask DataSeries, user doesn't need to specify a column name to be validated. 

When the input is a Pandas DataFrame or a dask DataFrame, user can both specify or not specify a column name to be validated. If user specify the column name, `validate_es_iban()` only returns the validation result for the specified column. If user doesn't specify the column name, `validate_es_iban()` returns the validation result for the whole DataFrame.

In [9]:
from dataprep.clean import validate_es_iban
print(validate_es_iban("ES771234-1234-16 1234567890"))
print(validate_es_iban("R1601101050000010547023795"))
print(validate_es_iban("999 999 999"))
print(validate_es_iban("51824753556"))
print(validate_es_iban("004085616"))
print(validate_es_iban("hello"))
print(validate_es_iban(np.nan))
print(validate_es_iban("NULL"))

True
False
False
False
False
False
False
False

### Series

In [10]:
validate_es_iban(df["iban"])

0     True
1    False
2    False
3    False
4    False
5    False
6    False
7    False
Name: iban, dtype: bool

### DataFrame + Specify Column

In [11]:
validate_es_iban(df, column="iban")

0     True
1    False
2    False
3    False
4    False
5    False
6    False
7    False
Name: iban, dtype: bool

### Only DataFrame

In [12]:
validate_es_iban(df)

    iban  address
0   True    False
1  False    False
2  False    False
3  False    False
4  False    False
5  False    False
6  False    False
7  False    False